alplabai/gd32-bridge-firmware/hal/gd32/pwm.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * GD32G5x3 bridge HAL backend -- PWM output.
 * Split move-only from hal/bridge_hw_gd32.c (fw v0.2.8); see
 * hal/gd32/init.c for the backend-wide implementation notes.
 */

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "bridge_hw.h"
#include "gd32g5x3.h"

#include "bridge_critical.h"
#include "gd32_common.h"

/* ----------------------------------------------------------------- */
/* PWM channels (TIMER0 + TIMER7).                                    */
/* ----------------------------------------------------------------- */

/* E1M PWM channel -> GD32 (timer, channel, output kind, pad, AF).
 * Sourced from `metadata/e1m_modules/v2n/gd32-io-mcu-map.tsv` for the
 * pad column; AF + timer-channel from the GD32G553xx Datasheet Rev2.0
 * Tables 2-10..2-13 (pin alternate-function summary).
 *
 *   PWM0  PA11  TIMER0_MCH0 (complement.) AF6
 *   PWM1  PB1   TIMER0_MCH2 (complement.) AF6
 *   PWM2  PB14  TIMER0_MCH1 (complement.) AF6
 *   PWM3  PC5   TIMER0_MCH3 (complement.) AF6
 *   PWM4  PC10  TIMER7_MCH0               AF4
 *   PWM5  PC11  TIMER7_MCH1               AF4
 *   PWM6  PC12  TIMER7_MCH2               AF4
 *   PWM7  PD0   TIMER7_MCH3               AF6
 *
 * Every PWM rides a distinct TIMER channel's complementary output,
 * so per-channel duty cycles are fully independent.  Each channel's
 * main output (CHx) is unused on V2N -- only the complementary
 * (CHxN) pad sits on the E1M PWM connector.
 *
 * Periods are SHARED across all PWMs of the same timer (TIMER0:
 * PWM0..3; TIMER7: PWM4..7) because each TIMER has one ARR.  The
 * per-channel `bridge_hw_pwm_set` body updates the timer's ARR every
 * call -- last write wins.  In typical V2N use the host sets the
 * same period across each group so this doesn't surface. */

const gd32_pwm_ch_t pwm_channels[] = {
	[0] = { TIMER0, TIMER_CH_0, true, GPIOA, GPIO_PIN_11, GPIO_AF_6 },
	[1] = { TIMER0, TIMER_CH_2, true, GPIOB, GPIO_PIN_1, GPIO_AF_6 },
	[2] = { TIMER0, TIMER_CH_1, true, GPIOB, GPIO_PIN_14, GPIO_AF_6 },
	[3] = { TIMER0, TIMER_CH_3, true, GPIOC, GPIO_PIN_5, GPIO_AF_6 },
	[4] = { TIMER7, TIMER_CH_0, true, GPIOC, GPIO_PIN_10, GPIO_AF_4 },
	[5] = { TIMER7, TIMER_CH_1, true, GPIOC, GPIO_PIN_11, GPIO_AF_4 },
	[6] = { TIMER7, TIMER_CH_2, true, GPIOC, GPIO_PIN_12, GPIO_AF_4 },
	[7] = { TIMER7, TIMER_CH_3, true, GPIOD, GPIO_PIN_0, GPIO_AF_6 },
};
_Static_assert(sizeof(pwm_channels) / sizeof(pwm_channels[0]) == PWM_CHANNEL_COUNT,
               "pwm_channels size must match PWM_CHANNEL_COUNT");

/* No read-back cache: bridge_hw_pwm_get reads CAR/CHxCV straight from
 * the timer so the host sees what the silicon is actually generating,
 * never a software echo of its own request (silicon lesson 2026-06-04:
 * a cache echo "verified" PWM for weeks while the pads were idle). */

/* Per-timer init.  Called once per peripheral from bridge_hw_init();
 * Advanced timers need timer_primary_output_config(ENABLE) before any
 * output pin actually drives (vs basic timers, where the channel
 * enable is sufficient). */
void pwm_timer_init(uint32_t periph)
{
	timer_parameter_struct ip;
	timer_struct_para_init(&ip);
	ip.prescaler         = (uint16_t)PWM_TIMER_PRESCALER;
	ip.alignedmode       = TIMER_COUNTER_EDGE;
	ip.counterdirection  = TIMER_COUNTER_UP;
	ip.period            = PWM_TIMER_ARR_MAX; /* 65.5 ms default; per-set */
	ip.clockdivision     = TIMER_CKDIV_DIV1;
	ip.repetitioncounter = 0u;
	timer_deinit(periph);
	timer_init(periph, &ip);
	/* Auto-reload shadow: TIMERx_CAR writes land in the preload register
	 * only and transfer to the active reload at the next update event
	 * (User Manual Rev1.2 p.575-576, Fig 23-5 / 23-7) instead of hitting
	 * the live comparator mid-period -- see bridge_hw_pwm_set for the
	 * glitch this prevents. */
	timer_auto_reload_shadow_enable(periph);
	timer_primary_output_config(periph, ENABLE);
	timer_enable(periph);
}

/* #129: how a one-shot is armed, and why it needs tracking.
 *
 * Single-pulse mode halts the counter at the next update event, and that
 * update RELOADS CNT to 0.  In PWM0 (output active while CNT < CHxCV)
 * every CHxCV >= 1 therefore reads as active at CNT == 0, so the halted
 * one-shot parks its pad at the ACTIVE level and stays there until some
 * later bridge_hw_pwm_set -- the exact failure a one-shot exists to
 * prevent.  No choice of ARR/CHxCV fixes that in PWM0: CHxCV == 0 emits
 * no pulse at all, and any other value is active at CNT == 0.
 *
 * PWM1 inverts the comparison (inactive while CNT < CHxCV), so the same
 * halt-at-CNT-0 leaves the pad INACTIVE.  The pulse is then the window
 * between the compare match and the reload:
 *     delay  = CHxCV ticks (pad inactive)
 *     pulse  = ARR - CHxCV + 1 ticks (pad active)
 * With CHxCV fixed at PWM_ONE_SHOT_DELAY_TICKS and ARR = pulse_us, that
 * is a 1 us lead-in followed by exactly pulse_us of active output, then a
 * clean return to idle.
 *
 * The mode is per-channel state that outlives the call, so it is tracked:
 * bridge_hw_pwm_set restores PWM0 (alongside the SPM clear it already
 * does) and bridge_hw_pwm_get has to invert its duty arithmetic while a
 * channel is still in the one-shot mode, or it reports the lead-in as the
 * pulse width. */
#define PWM_ONE_SHOT_DELAY_TICKS 1u

static volatile bool pwm_one_shot[PWM_CHANNEL_COUNT];

/* Per-channel init.  Sets PWM mode 0 (output high while counter <
 * compare) and 0 duty -- HW pad sits low until the host issues a
 * bridge_hw_pwm_set with a non-zero duty. */
void pwm_channel_init(const gd32_pwm_ch_t *ch)
{
	timer_oc_parameter_struct oc;
	timer_channel_output_struct_para_init(&oc);
	if (ch->complement) {
		oc.outputstate  = TIMER_CCX_DISABLE;
		oc.outputnstate = TIMER_CCXN_ENABLE;
	} else {
		oc.outputstate  = TIMER_CCX_ENABLE;
		oc.outputnstate = TIMER_CCXN_DISABLE;
	}
	oc.ocpolarity   = TIMER_OC_POLARITY_HIGH;
	oc.ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
	oc.ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
	oc.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
	timer_channel_output_config(ch->periph, ch->channel, &oc);
	timer_channel_output_pulse_value_config(ch->periph, ch->channel, 0u);
	timer_channel_output_mode_config(ch->periph, ch->channel, TIMER_OC_MODE_PWM0);
	/* Compare shadow: TIMERx_CHxCV writes land in the preload register
	 * only and transfer to the active compare at the next update event
	 * (User Manual Rev1.2 p.649, CH0COMSEN) instead of the live
	 * comparator -- the manual permits leaving this disabled only in
	 * single-pulse mode, and this channel also runs continuous PWM. */
	timer_channel_output_shadow_config(ch->periph, ch->channel, TIMER_OC_SHADOW_ENABLE);
	/* This function is the one place PWM0 is (re-)asserted from scratch,
     * so it owns clearing the one-shot mode shadow (#129).  Both callers
     * -- bridge_hw_init at boot and pwm_capture.c's full output-stage
     * restore at capture end -- pass &pwm_channels[i], so recovering the
     * index by pointer arithmetic keeps the invariant "hardware is in
     * PWM0 <=> pwm_one_shot[] is false" true without either caller having
     * to know the shadow exists.  Without this, a one-shot followed by a
     * capture session would leave the flag set while the hardware was
     * back in PWM0, and bridge_hw_pwm_get would invert its arithmetic
     * against a channel that is no longer inverted.
     *
     * Note the mode write above is NOT affected by the compare preload
     * just enabled: CHxCOMSEN preloads the compare VALUE only, and this
     * tree sets no CTL1.CCPC anywhere, so OCxM takes effect immediately. */
	const size_t idx = (size_t)(ch - pwm_channels);
	if (idx < PWM_CHANNEL_COUNT) {
		pwm_one_shot[idx] = false;
	}
}

/* Sticky per-TIMER counter-alignment mode set by bridge_hw_pwm_configure.
 * Index 0 = TIMER0 (PWM0..3), index 1 = TIMER7 (PWM4..7); value is the
 * wire align_mode (0 edge / 1 center-up / 2 center-down / 3 center-both,
 * matching alp_pwm_align_t).  CAM is a timer-wide field shared by every
 * channel on the timer, so this is per-timer, not per-channel:
 * last-write-wins across sibling channels (documented in the protocol
 * spec).  bridge_hw_pwm_set / _get read it to convert between commanded
 * period/duty and the ARR/compare ticks, because a center-aligned
 * counter runs 0->ARR->0 (period == 2*ARR ticks) where an edge-aligned
 * counter runs 0->ARR (period == ARR+1 ticks). */
/* `volatile` on both shadows (#134): each is written from one transport
 * ISR and read from the other, at NVIC group priorities 1 and 2, so the
 * compiler has no reason to reload either across a call.  Today nothing
 * exposes the miss because the build sets no -O at all (#26) -- that is
 * luck, not design, and PR #106 pins -Os. */
static volatile uint8_t pwm_align_mode[2];

/* TIMER base -> pwm_align_mode index. */
static uint8_t pwm_timer_index(uint32_t periph)
{
	/* The ternary's operands are the unsigned-int constants 0u/1u
	 * (usual arithmetic conversions promote the whole expression to
	 * unsigned int before the narrowing return), so -Wconversion can't
	 * see that only 0 or 1 ever reaches this uint8_t return. Both fit;
	 * the cast is a no-op at runtime, added only to satisfy the warning
	 * (#109 TODO). */
	return (uint8_t)((periph == TIMER0) ? 0u : 1u);
}

int bridge_hw_pwm_set(uint8_t channel, uint32_t period_ns, uint32_t duty_ns)
{
	if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;
	if (duty_ns > period_ns) return BRIDGE_HW_ERR_INVAL;

	/* Clear OPM if a prior bridge_hw_pwm_single_pulse left the timer
     * in one-pulse mode -- per the contract, a subsequent PWM_SET
     * returns the channel (and any other channels on the same timer)
     * to continuous output. */
	timer_single_pulse_mode_config(pwm_channels[channel].periph, TIMER_SP_MODE_REPETITIVE);
	/* ...and restore PWM0 if that one-shot also left the channel in the
     * inverted compare mode it needs to return the pad to idle (#129).
     * Same contract clause as the SPM clear above: a PWM_SET returns the
     * channel to continuous output, which has to include the sense of the
     * comparison, not just the halt behaviour.  Unconditional rather than
     * guarded on pwm_one_shot[]: re-asserting the mode a channel is
     * already in is a plain register write with no edge, and it also
     * repairs a channel left in PWM1 by anything this array did not see. */
	timer_channel_output_mode_config(
	    pwm_channels[channel].periph, pwm_channels[channel].channel, TIMER_OC_MODE_PWM0);
	pwm_one_shot[channel] = false;

