alplabai/gd32-bridge-firmware/hal/gd32/pwm.c
	/* Round period + duty to whole microseconds (the timer tick). */
	uint32_t period_us = period_ns / PWM_TIMER_TICK_NS;
	uint32_t duty_us   = duty_ns / PWM_TIMER_TICK_NS;
	if (period_us == 0u) return BRIDGE_HW_ERR_RANGE;

	const gd32_pwm_ch_t *ch = &pwm_channels[channel];

	/* Snapshot CEN before the write block below decides whether to
	 * force a software update event.  Read here, before anything in
	 * this function touches CTL0, so it reflects the timer's state as
	 * this call found it. */
	const bool was_running = (TIMER_CTL0(ch->periph) & (uint32_t)TIMER_CTL0_CEN) != 0u;

	/* Convert commanded period/duty to ARR + compare, honouring the
	 * timer's configured alignment (bridge_hw_pwm_configure).  The
	 * up-counter (edge) counts 0..ARR inclusive -> period == ARR+1
	 * ticks and high-time == compare ticks.  A center-aligned counter
	 * runs 0->ARR->0 -> period == 2*ARR ticks and high-time ==
	 * 2*compare ticks (compare on the up-ramp + compare on the
	 * down-ramp), so both ARR and compare are the commanded value
	 * halved.  ARR must fit in 16 bits either way; clamp on over-range
	 * so the timer never gets an invalid reload. */
	uint32_t arr, cmp;
	if (pwm_align_mode[pwm_timer_index(ch->periph)] == 0u) {
		if (period_us > PWM_TIMER_ARR_MAX + 1u) period_us = PWM_TIMER_ARR_MAX + 1u;
		if (duty_us > period_us) duty_us = period_us;
		arr = period_us - 1u;
		cmp = duty_us;
	} else {
		uint32_t half_period = period_us / 2u;
		uint32_t half_duty   = duty_us / 2u;
		if (half_period == 0u) return BRIDGE_HW_ERR_RANGE; /* period < 2 us */
		if (half_period > PWM_TIMER_ARR_MAX) half_period = PWM_TIMER_ARR_MAX;
		if (half_duty > half_period) half_duty = half_period;
		arr = half_period;
		cmp = half_duty;
	}

	/* cmp must fit the 16-bit CHxCV.  The edge-aligned branch above
	 * clamps period_us but not the resulting compare, so a 100 %-duty
	 * request at the clamped max period (cmp == PWM_TIMER_ARR_MAX + 1,
	 * i.e. 65536) would otherwise truncate to 0 in CHxCV and park the
	 * pad at the complementary rail while still answering STATUS_OK
	 * (#16).  Reject rather than silently honour a different duty than
	 * commanded -- bridge_hw_pwm_get reads the live registers back for a
	 * host that wants to poll what IS running instead. The
	 * centre-aligned branch above already keeps half_duty <=
	 * PWM_TIMER_ARR_MAX so this never trips there; the guard lives at
	 * this single write site so neither branch can reintroduce the
	 * truncation. */
	if (cmp > PWM_TIMER_ARR_MAX) return BRIDGE_HW_ERR_RANGE;

	/* Updates ALL channels of the same timer -- the contract documents
	 * this shared-ARR constraint.  CHxCOMSEN + ARSE are enabled
	 * (pwm_channel_init / pwm_timer_init, #43) so the two writes below
	 * land in the preload register only and transfer to the live
	 * comparator at this timer's own next update event (User Manual
	 * Rev1.2 p.575-576 Fig 23-5/23-7 auto-reload shadow timing; p.649
	 * CH0COMSEN).  That is exactly the glitch-free behaviour #43 asked
	 * for, and on a channel already running cleanly mid-period it is
	 * also the ONLY acceptable behaviour: forcing a software update
	 * event here resets CNT to 0 (p.645) and restarts the period on
	 * every single PWM_SET call, and because ARR/CTL0/CEN are
	 * timer-wide it re-phases every sibling channel on the timer too --
	 * a guaranteed full-period glitch strictly worse than the rare
	 * runt/stretch #43 set out to fix (PR #82 review).
	 *
	 * The one case that genuinely needs a forced transfer is #8's
	 * recovery path: a prior bridge_hw_pwm_single_pulse leaves the
	 * timer HALTED -- hardware clears CEN at the one-shot's own update
	 * event (p.617-618) -- with no future overflow ever pending to
	 * promote the shadow.  was_running (snapshotted above, before this
	 * function's own SPM clear or these writes could change anything)
	 * distinguishes the two: force UPG only when the timer was NOT
	 * running, i.e. exactly the halted-by-single-pulse case.  (SPM
	 * itself isn't checked here as a second signal: the SPM clear a few
	 * lines above already runs unconditionally on every call, so by
	 * this point SPM always reads REPETITIVE regardless of the prior
	 * state -- CEN is the one bit that still reflects how this call
	 * found the timer.)
	 *
	 * Gating this couples to hal/gd32/pwm_capture.c: it can no longer
	 * infer promotion from a raw TIMER_CAR read (ambiguous once a
	 * second write lands before the first is confirmed promoted, #82
	 * review round 2), so this call hands the outcome over explicitly
	 * via pwm_car_shadow_defer/_commit below rather than leaving
	 * pwm_capture.c to reconstruct it after the fact. */
	timer_autoreload_value_config(ch->periph, arr);
	timer_channel_output_pulse_value_config(ch->periph, ch->channel, cmp);
	if (was_running) {
		pwm_car_shadow_defer(ch->periph, arr);
	} else {
		/* #89: on a sync-master timer this also fires TRGO0, glitching a slave synced off it. */
		timer_event_software_generate(ch->periph, TIMER_EVENT_SRC_UPG);
		pwm_car_shadow_commit(ch->periph, arr);
	}
	timer_enable(ch->periph); /* idempotent if already running; re-arms
	                            * CEN after a prior single-pulse left it
	                            * clear (#8) */
	return BRIDGE_HW_OK;
}

int bridge_hw_pwm_get(uint8_t channel, uint32_t *period_ns, uint32_t *duty_ns)
{
	if (period_ns == 0 || duty_ns == 0) return BRIDGE_HW_ERR_INVAL;
	*period_ns = 0u;
	*duty_ns   = 0u;
	if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;

	const gd32_pwm_ch_t *ch = &pwm_channels[channel];

	/* Hardware read-back: convert the live CAR/CHxCV ticks to ns at
     * the fixed 1 us tick.  This reports what the pad is actually
     * doing -- including the shared-period reality (one ARR per
     * timer: a PWM_SET on a sibling channel moves this channel's
     * reported period too) and the boot default (65.536 ms period,
     * 0 duty) before the first PWM_SET.  CHxCV can legitimately read
     * ARR + 1 (a pre-#129 single-pulse programmed compare past the
     * period); clamp so duty never reports > period.
     *
     * The tick->ns conversion mirrors bridge_hw_pwm_set's alignment
     * math: edge-aligned period is CAR+1 ticks, center-aligned is
     * 2*CAR ticks (and duty 2*CV), so a channel configured
     * center-aligned reads back the same period/duty it was
     * commanded. */
	const uint32_t car = TIMER_CAR(ch->periph) & PWM_TIMER_ARR_MAX;
	uint32_t       cv  = timer_channel_capture_value_register_read(ch->periph, ch->channel);
	if (cv > car + 1u) cv = car + 1u;
	if (pwm_one_shot[channel]) {
		/* One-shot channels sit in PWM1, where CHxCV is the INACTIVE
         * lead-in and the active width is CAR - CHxCV + 1 (#129).
         * Reading CHxCV as high-time here would report a 1 us pulse for
         * every one-shot regardless of what was commanded.  One-shots are
         * always edge-aligned -- bridge_hw_pwm_single_pulse refuses a
         * center-aligned timer outright -- so there is no center variant
         * to handle. */
		*period_ns = (car + 1u) * PWM_TIMER_TICK_NS;
		*duty_ns   = (car - cv + 1u) * PWM_TIMER_TICK_NS;
		return BRIDGE_HW_OK;
	}
	if (pwm_align_mode[pwm_timer_index(ch->periph)] == 0u) {
		*period_ns = (car + 1u) * PWM_TIMER_TICK_NS;
		*duty_ns   = cv * PWM_TIMER_TICK_NS;
	} else {
		*period_ns = 2u * car * PWM_TIMER_TICK_NS;
		*duty_ns   = 2u * cv * PWM_TIMER_TICK_NS;
		if (*duty_ns > *period_ns) *duty_ns = *period_ns;
	}
	return BRIDGE_HW_OK;
}

int bridge_hw_pwm_configure(uint8_t  channel,
                            uint8_t  align_mode,
                            uint32_t dead_time_ns,
                            uint8_t  break_cfg)
{
	if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;

	/* align_mode 0..3 map to CTL0.CAM (0 edge, 1 center-up, 2
	 * center-down, 3 center-both -- alp_pwm_align_t).  Reject out of
	 * range before touching hardware so a bad value leaves the timer
	 * untouched. */
	if (align_mode > 3u) return BRIDGE_HW_ERR_INVAL;

