alplabai/gd32-bridge-firmware/hal/gd32/pwm.c
	/* dead_time_ns and break_cfg are advanced-timer features the GD32
	 * TIMER0/7 silicon HAS, but that the V2N E1M routing does not
	 * physically expose, so honouring them would be an unverifiable
	 * register write (exactly the "cache echo verified PWM while the
	 * pads were idle" trap this file warns about above):
	 *   - Dead-time is the guard gap between a channel's main (CHx) and
	 *     complementary (CHxN) outputs, but only the CHxN pad sits on
	 *     the E1M PWM connector (see the channel-map comment) -- there
	 *     is no complementary PAIR on the wire for a dead-time to act
	 *     on, so any DTCFG value is physically inert.
	 *   - The break input needs a BRK pad, and the V2N gd32-io-mcu-map
	 *     routes none -- the break logic could be armed but nothing
	 *     could ever trigger it.
	 * Both therefore return NOSUPPORT on this board (a hardware-routing
	 * limit, not an unimplemented feature); a future carrier that
	 * routes the complementary pair / a BRK pad would lift this.
	 * align_mode == 0 with both zero is still the idempotent
	 * "set-to-defaults" call and succeeds. */
	if (dead_time_ns != 0u) return BRIDGE_HW_ERR_NOTIMPL;
	if (break_cfg != 0u) return BRIDGE_HW_ERR_NOTIMPL;

	const gd32_pwm_ch_t *ch  = &pwm_channels[channel];
	const uint8_t        idx = pwm_timer_index(ch->periph);
	if (pwm_align_mode[idx] == align_mode) return BRIDGE_HW_OK; /* no change */

	/* CAM is a shared timer-wide field and the GD32 (like most STM32-
	 * lineage advanced timers) latches it only while the counter is
	 * stopped, so bracket the change in disable/enable.  This briefly
	 * halts every channel on the timer -- acceptable at config time,
	 * and last-write-wins across the sibling channels is the documented
	 * contract.  The counter value + ARR/compare survive the toggle, so
	 * a running duty resumes with the new alignment on the next
	 * update.
	 *
	 * PRESERVE the run state: a prior bridge_hw_pwm_single_pulse on a
	 * sibling channel leaves the timer HALTED (hardware clears CEN at
	 * the one-shot's update event) with SP=SINGLE and a pulse-shaped
	 * ARR/compare still latched.  Unconditionally re-enabling here would
	 * re-arm that one-shot and fire a SECOND, uncommanded pulse on the
	 * sibling pad -- an actuation with no host command.  So only
	 * re-enable if the timer was actually running when we entered. */
	static const uint32_t cam_map[4] = {
		TIMER_COUNTER_EDGE,        /* 0: edge          */
		TIMER_COUNTER_CENTER_UP,   /* 1: center-up     */
		TIMER_COUNTER_CENTER_DOWN, /* 2: center-down   */
		TIMER_COUNTER_CENTER_BOTH, /* 3: center-both   */
	};
	/* #134: this whole block is one critical section, and the shadow is
     * published INSIDE it.
     *
     * The read-modify-write below touches the WHOLE of TIMER_CTL0 to edit
     * one field, and CEN (bit 0) and SPM (bit 3) live in that same
     * register -- written by bridge_hw_pwm_set and
     * bridge_hw_pwm_single_pulse, which reach this timer from the OTHER
     * transport's ISR.  Unprotected, this happened: I2C0_EV (priority 2)
     * snapshots `ctl0` with CEN = 0 and SPM = 0; the SPI CS-EXTI handler
     * (priority 1) pre-empts and runs a single-pulse, setting SPM and
     * CEN; this side resumes and writes its stale word back, clearing
     * BOTH -- the one-shot never fires and its caller was told
     * BRIDGE_HW_OK.
     *
     * Publishing pwm_align_mode[] inside the section closes the second
     * half: it used to be written AFTER the hardware it describes, so a
     * pre-empting single_pulse could read a shadow saying "edge-aligned"
     * off a timer already switched to center-aligned and pass a guard it
     * should have failed.  Inside the section a pre-empting caller sees
     * either the old alignment consistently or the new one, never a
     * disagreement.
     *
     * The section covers a disable, one RMW, an enable and a store --
     * short enough for the CS-EXTI handler's deadline (bridge_critical.h).
     *
     * RESIDUAL, deliberately not fixed here: the REVERSE direction is
     * still open.  If bridge_hw_pwm_configure is the one reached from
     * CS-EXTI (priority 1) and bridge_hw_pwm_single_pulse from I2C0_EV
     * (priority 2), configure pre-empts single_pulse mid-sequence --
     * between its SPM write and its timer_enable -- and single_pulse then
     * resumes and enables a one-shot whose alignment guard was checked
     * against the alignment configure has since changed.  Closing that
     * needs single_pulse's own register sequence to become a section too,
     * which lands squarely in open PR #82's rewrite of that function.
     * Tracked under #19. */
	const uint32_t sect        = bridge_irq_lock();
	const bool     was_running = (TIMER_CTL0(ch->periph) & (uint32_t)TIMER_CTL0_CEN) != 0u;
	timer_disable(ch->periph);
	uint32_t ctl0 = TIMER_CTL0(ch->periph);
	ctl0 &= ~(uint32_t)TIMER_CTL0_CAM;
	ctl0 |= cam_map[align_mode];
	TIMER_CTL0(ch->periph) = ctl0;
	if (was_running) timer_enable(ch->periph);
	pwm_align_mode[idx] = align_mode;
	bridge_irq_unlock(sect);
	return BRIDGE_HW_OK;
}

int bridge_hw_pwm_single_pulse(uint8_t channel, uint32_t pulse_ns)
{
	if (channel >= PWM_CHANNEL_COUNT) return BRIDGE_HW_ERR_RANGE;

	const gd32_pwm_ch_t *ch = &pwm_channels[channel];

	/* One-pulse mode is edge-aligned only.  The ARR math below assumes
	 * an up-counter (period == ARR+1 ticks); on a center-aligned timer
	 * (bridge_hw_pwm_configure) the counter runs 0->ARR->0 with an
	 * update event at BOTH crest and trough, so OPM would halt at the
	 * wrong point and the emitted pulse width would be neither
	 * `pulse_us` nor even deterministic (and the output can freeze
	 * HIGH at the halt).  Refuse rather than fire a wrong-width pulse;
	 * the host must set align_mode back to edge (0) first. */
	if (pwm_align_mode[pwm_timer_index(ch->periph)] != 0u) return BRIDGE_HW_ERR_NOTIMPL;

	const uint32_t pulse_us = pulse_ns / PWM_TIMER_TICK_NS;
	if (pulse_us == 0u) return BRIDGE_HW_ERR_RANGE;
	/* ARR is the FULL one-shot window (lead-in + pulse) and it is a
     * 16-bit register, so pulse_us itself must fit: the widest one-shot
     * this timer can emit is PWM_TIMER_ARR_MAX us.  The old code clamped
     * silently to PWM_TIMER_ARR_MAX + 1 and still answered STATUS_OK --
     * success for a pulse it did not emit (#16).  Refuse instead: a
     * caller asking for 70 ms needs to be told, not to find out on a
     * scope. */
	if (pulse_us > PWM_TIMER_ARR_MAX) return BRIDGE_HW_ERR_RANGE;

